Autodesk.Revit.DB.WorksharingDisplayMode
Indicates which worksharing display mode a view is in.
Since:
2012

Autodesk.Revit.DB.WorksharingDisplayMode.Worksets
The view is displaying which workset each element is assigned to.

Autodesk.Revit.DB.WorksharingDisplayMode.ModelUpdates
The view is displaying model updates.

Autodesk.Revit.DB.WorksharingDisplayMode.Owners
The view is displaying the specific owners of elements.

Autodesk.Revit.DB.WorksharingDisplayMode.CheckoutStatus
The view is displaying the checkout status of elements.

Autodesk.Revit.DB.WorksharingDisplayMode.Off
No active worksharing display mode.